---

C#Visual BasicVisual C++

Revit 2024 API
---
TopographySurface..::..AsSiteSubRegion Method
TopographySurface Class See Also Send Feedback
---

Obtains the subregion object represented by this element.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014

# Syntax

C#
---

    public SiteSubRegion AsSiteSubRegion()

Visual Basic
---

    Public Function AsSiteSubRegion As SiteSubRegion

Visual C++
---

    public:
    SiteSubRegion^ AsSiteSubRegion()

#### Return Value

The SiteSubRegion element. If this does not represent a SiteSubRegion, this will be nullNothingnullptra null reference (Nothing in Visual Basic).

# Remarks

This applies to TopographySurface and SiteSubRegion elements.

# See Also

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace